app/Http/Controllers/Admin/ProductController.php

select `color`.`id` from `color` inner join `product_color` on `color`.`id` = `product_color`.`color_id` where `product_color`.`product_id` = '38'
select `size`.`id` from `size` inner join `product_size` on `size`.`id` = `product_size`.`size_id` where `product_size`.`product_id` = '38'
---
    public function edit($id)
    {
        Breadcrumb::title(trans('admin_product.create'));

        $product = $this->product->find($id);

        $tree = $this->category->arrTreeCategories(0);

        $sizes = $this->size->all();

        $colors = $this->color->all();
       // $producers = $this->producer->all();
        $product_categories = $product->categories()->pluck('product_categories.id')->toArray();

        $out_put_categories = $this->category->outTreeCategoryRadioCheckbox($tree, $type = 'checkbox', $product_categories, $disable_id = [], $root = false);

        $metadata = $product->meta;

        $product_color = $product->colors()->pluck('color.id')->toArray();

        $product_size = $product->sizes()->pluck('size.id')->toArray();