app/Repositories/ProductRepositoryEloquent.php

    public function store(array $input)
    {
        $input['is_new'] = empty($input['is_new']) ? 0 : 1;
        $input['active'] = empty($input['active']) ? 0 : 1;

        $input['start_date_promotion'] = !empty($input['start_date_promotion']) ? convertDatabaseTime($input['start_date_promotion'], PHP_DATE, DATABASE_DATE) : date(DATABASE_DATE);

        $input['end_date_promotion'] = !empty($input['end_date_promotion']) ? convertDatabaseTime($input['end_date_promotion'], PHP_DATE, DATABASE_DATE) : date(DATABASE_DATE);

        $product = $this->model->create($input);

        if (!empty($input['photos'])) {
            $this->uploadPhotos($input['photos'], $product->id);
        }

        if (!empty($input['category_id'])) { //1 mảng loại sản phẩm trong outTreeCategoryRadioCheckbox
            $product->categories()->attach($input['category_id']);
        }

        if (!empty($input['color_id'])) {
            $product->colors()->attach($input['color_id']);
        }

        if (!empty($input['size_id'])) {
            $product->sizes()->attach($input['size_id']);
---
insert into `product_color` (`color_id`, `product_id`) values ('1', '43'), ('2', '43')
insert into `product_size` (`product_id`, `size_id`) values ('41', '1'), ('41', '2'), ('41', '3')

        if (!empty($input['size_id'])) {
            $product->sizes()->attach($input['size_id']);
        }else {
            $product->sizes()->detach();//neu chưa có
---
delete from `product` where `id` = '33'

    private function uploadPhotos($files, $product_id, $level = 0)
    {

        $config = config('photos.product_photo');

        foreach ($files as $key => $value) {

            $info = $this->storePhoto($value, $config);

            $arr = [
                'product_id' => $product_id,
                'path' => $info['path'],
                'file_name' => $info['file_name'],
                'level' => $level
            ];

            ProductPhoto::create($arr);
---
insert into `product_photo` (`product_id`, `path`, `file_name`, `level`) values ('43', 'product', '5b1561ea2e7ea8.3298136220180604225938.jpeg', '0')